results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg1024-tps10000-batch16384-acks1-prod12-compnone-trial2/producer-perf-5.log
producer_index=5
producer_count=12
producer_records=8333
producer_throughput=833
1 records sent, 0.1 records/sec (0.00 MB/sec), 8992.0 ms avg latency, 8992.0 ms max latency.
4650 records sent, 915.7 records/sec (0.89 MB/sec), 1818.8 ms avg latency, 2878.0 ms max latency.
8333 records sent, 516.807244 records/sec (0.50 MB/sec), 2315.55 ms avg latency, 8992.00 ms max latency, 2655 ms 50th, 3125 ms 95th, 3325 ms 99th, 3372 ms 99.9th.